<template>
    <div class="me">
        <article>
            <h2>
                公众号的规划
            </h2>
            <p>
                emmm，对这个公众号的定位呢？主要是自己看到了bobo老师的公众号，觉得这种分享真的很有意思，把自己成长中的学习过程，思考，感悟分享出来，真的是一件很有趣的事情吧？
            </p>
            <p>
                ：）
            </p>
            <p>
                这个公众号分享的内容主要涵盖：日常总结，读书感悟，技术博文，软件分享，方法论这五类，暂时没有别的想法，先搞这些吧，hhhh（这样已经很忙了啊喂
            </p>
            <p>
                更新频率呢？大概是：每个月一篇总结，读书感悟每个月有余力会发，技术博文、软件分享、方法论就只能随缘了hhh，啥时候写好了啥时候发，毕竟我菜，毕竟我也没底hhh（我觉得这样也很充实好不好
            </p>
            <p>
                emmm，好像就这些说的？嗯，就这样。
            </p>

            <h2>
                对我未来的展望
            </h2>
            <p>
                稍微熟悉我一点的人都知道我是个环保主义者，我从小有个理想，就是想要为了世界环境保护事业奋斗终生，这个理想到现在也没变。
            </p>
            <p>
                你可能就会想问我为啥会读计算机，不是去读环境工程这一类的。因为我真的不适合搞科研啊哈哈哈，太惭愧了。高中的时候我看了周迅的一段话，大概是将人生是要用倒推的手法来推演的，我就推演了一下自己的人生，如果我以后想要投身环保事业，我应该依靠什么，我觉得最重要的是钱，有了钱就可以建立关于环保的基金会，就可以把钱投给需要的地方，那哪个行业赚钱效应最好呢？互联网。所以我来学了计算机，然后我现在又在努力的学习投资，毕竟时间赚钱并无定法，不管黑猫白猫只要能抓住老鼠就是好猫。
            </p>
            <p>
                那既然我最远大的理想你已经了解了，那么我就来聊聊近期的展望吧。
            </p>
            <p>
                2020年过去了四分之三，说实话是我成长最多的一年，具体成长的内容还是等年终总结的时候再聊吧，现在就只说规划：短期目标，截止年底，我要需要再读9本书，还需要对目前所学技术有较为深刻的理解，还需要继续学习投资。话很简单，但是事情却很多，希望我能加油，希望努力永远不会被辜负！加油💪！
            </p>
            <p>
                不出意外的话，年底个人网站会上线，之后也应该会在别的论坛更新一下文章，之后应该也会拾起荒废了好久的视频剪辑，在b站上做一个分享的up主，当然这些都是后话了。
            </p>
        </article>
    </div>
</template>

<script>
// @ is an alias to /src

export default {
    name: "Me",
}
</script>

<style lang="stylus" scoped>

.me 
    font-size 1.2rem
    line-height 1.5
    padding 3rem 3rem
    article
        max-width 60rem
        margin 0 auto
        h1, h2, h3, h4, h5, h6
            line-height 2.5rem
            margin-top 1.5rem
            margin-bottom .5rem
        h3 
            text-align end
        p
            color #3b4348
            text-indent: 1.8em;
            line-height 1.8rem
</style>
